//Задача №1
// Создать массив и заполнить его целыми
// числами от 1 до N (N – произвольное
// натуральное число). Вывести элементы
// массива на экран.

// int n = 10;
// int[] arr = new int [n]; // выделение памяти для нового массива
// int i = 0; // создание счетчика

// while (i < n)
// {
//     arr[i] = i + 1;
//     // Console.write (arr [1]);
//     // Console.write (' ');
//     Console.Write ($"{arr[i]} ");
//     i = i + 1;
// }

// или

// int n = 10;
// int[] arr = new int [n]; // выделение памяти для нового массива
// int i = 0; // создание счетчика

// while (i < arr.Length)  // применяем свойства массива arr.Length хранит кол-во элементов, под кот. выделена память (длина массива)
// {
//     arr[i] = i + 1;
//     // Console.write (arr [1]);
//     // Console.write (' ');
//     Console.Write ($"{arr[i]} ");
//     i = i + 1;
// }

// Задача №2
// Создать целочисленный массив на 10
// элементов и заполнить его произвольными
// числами. Вывести на экран чётные элементы
// массива.



